<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Creating views 1
© ExploreAI Academy

In this exercise, we learn how to create different types of views and how to drop views. 

Ensure that you have downloaded the database file Chinook.db.

## Learning objectives

By the end of this train, you should be able to:
- Create `LOOKUP`, `JOIN`, and `AGGREGATING` views.
- Drop a view.

First, let's load our sample database:

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [2]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

'Connected: @chinook.db'

In [10]:
%%sql
SELECT
    * 
FROM
    employees;

 * sqlite:///chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com'),
 (6, 'Mitchell', 'Michael', 'IT Manager', 1, '1973-07-01 00:00:00', '2003-10-17 00:00:00', '5827 Bowness Road NW', 'Calgary', 'AB', 'Canada', 'T3B 0C5', '+1 (403) 246-9887', '+1 (403) 246-9899', 'michael@chinookcorp.com'),
 (7, 'King', 'Robert', 'IT Staff', 6, '1970-05-29 00:00:00', '2004-01-02 00:00:00', '590 Columbia Boulevard West', 'Lethbridge', 'AB', 'Canada', 'T1K 5N8', '+1 (403) 456-9986', '+1 (403) 456-8485', 'robert@chinookcorp.com'),
 (8, 'Callahan', 'Laura', 'IT Staff', 6, '1968-01-09 00:00:00', '2004-03-04 00:00:00', '923 7 ST NW', 'Lethbridge', 'AB', 'Canada', 'T1H 1Y8', '+1 (403) 467-3351', '+1 (403) 467-8772', 'laura@chinookcorp.com')]

Here is a [view](https://www.lucidchart.com/pages/er-diagrams) of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:500px";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Create a `LOOKUP` view of the surname, first name, title, and country of each employee called `Employee_View`.

In [7]:
%%sql
CREATE VIEW Employee_View 
AS
    SELECT 
        LastName,
        FirstName,
        Title,
        Country
    FROM 
        employees;

 * sqlite:///chinook.db
Done.

[]

### Exercise 2


Query the `Employee_View` view to get a view of the sales team.

Use the wildcard operators and the LIKE query to filter all the employees in the specified view.

In [8]:
%%sql 
SELECT 
    *
FROM 
    Employee_View;

 * sqlite:///chinook.db
Done.

[('Adams', 'Andrew', 'General Manager', 'Canada'),
 ('Edwards', 'Nancy', 'Sales Manager', 'Canada'),
 ('Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('Johnson', 'Steve', 'Sales Support Agent', 'Canada'),
 ('Mitchell', 'Michael', 'IT Manager', 'Canada'),
 ('King', 'Robert', 'IT Staff', 'Canada'),
 ('Callahan', 'Laura', 'IT Staff', 'Canada')]

### Exercise 3


Create a `JOIN` view that will link up all the customers with the support staff assisting them, called `Customer_Support_View`. We want to view the following:

- First name of the customer
- Last name (surname) of the customer
- Country where the customer resides
- SupportRepId
- EmployeeId
- Last name of the employee
- First name of the employee
- Job title of the employee
- Country where the employee operated from

In [18]:
%%sql
CREATE VIEW Customer_Support_View 
AS
    SELECT
        cus.LastName AS customer_lastname,
        cus.FirstName AS customer_firstname,
        cus.Country AS customer_country,
        cus.SupportRepId,
        emp.EmployeeId,
        emp.LastName AS employee_firstname,
        emp.FirstName AS employee_lastname,
        emp.Title,
        emp.Country AS employee_country
    FROM 
        customers AS cus
    INNER JOIN
        employees AS emp 
    ON 
        cus.SupportRepId=emp.EmployeeId;

 * sqlite:///chinook.db
(sqlite3.OperationalError) view Customer_Support_View already exists
[SQL: CREATE VIEW Customer_Support_View
AS
    SELECT
        cus.LastName AS customer_lastname,
        cus.FirstName AS customer_firstname,
        cus.Country AS customer_country,
        cus.SupportRepId,
        emp.EmployeeId,
        emp.LastName AS employee_firstname,
        emp.FirstName AS employee_lastname,
        emp.Title,
        emp.Country AS employee_country
    FROM
        customers AS cus
    INNER JOIN
        employees AS emp
    ON
        cus.SupportRepId=emp.EmployeeId;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### Exercise 4

Query the `Customer_Support_View` view to get a list of the names and surnames of the clients who were helped by an employee with the `Employeeid` '3'.

In [19]:
%%sql
SELECT
    *
FROM
    Customer_Support_View
WHERE
    EmployeeId=3;

 * sqlite:///chinook.db
Done.

[('Gonçalves', 'Luís', 'Brazil', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Tremblay', 'François', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Almeida', 'Roberto', 'Brazil', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Peterson', 'Jennifer', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Brooks', 'Michelle', 'USA', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Goyer', 'Tim', 'USA', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Ralston', 'Frank', 'USA', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Brown', 'Robert', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Francis', 'Edward', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Sullivan', 'Ellie', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Zimmermann', 'Fynn', 'Germany', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Schröder', 'Niklas', 'Germany', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Girard', 'Wyatt', 'France', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Mercier', 'Isabelle', 'France', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Hämäläinen', 'Terhi', 'Finland', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Kovács', 'Ladislav', 'Hungary', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ("O'Reilly", 'Hugh', 'Ireland', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Jones', 'Emma', 'United Kingdom', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Hughes', 'Phil', 'United Kingdom', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Pareek', 'Manoj', 'India', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Srivastava', 'Puja', 'India', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada')]

### Exercise 5

Create an `AGGREGATING` view that counts the number of customers that are currently being serviced per country, called `Customer_per_Country_View`.

We would like to see the country name and the number of customers in this view.

In [24]:
%%sql
CREATE VIEW Customer_per_Country_View
AS
SELECT
    Country,
    COUNT(LastName) As no_of_customers
FROM
    customers
GROUP BY Country;

 * sqlite:///chinook.db
Done.

[]

### Exercise 6
Write a query that returns the country with the most customers from `Customer_per_Country_View`.

In [27]:
%%sql 
SELECT 
    Country,
    MAX(no_of_customers)
FROM
    Customer_per_Country_View;

 * sqlite:///chinook.db
Done.

[('USA', 13)]

### Exercise 7

Write a query that will delete the `Employee_View` view.

In [29]:
%%sql
DROP VIEW Employee_View;

 * sqlite:///chinook.db
Done.

[]

### Challenge question

Write a query that returns the number of customers that each support employee services, along with the name of the employee. Call this view `Support_Person_Stats`.

To do this, we will need to create a view, join the Customer and Employee tables, and use the `COUNT` and `GROUP BY` functions to aggregate the number of employees serviced by each employee.

In [41]:
%%sql
CREATE VIEW Support_Person_Stats
AS
SELECT
    emp.EmployeeId,
    emp.LastName AS employee_firstname,
    emp.FirstName AS employee_lastname,
    COUNT(cus.SupportRepId) As no_of_customers
FROM 
    customers AS cus
INNER JOIN
    employees AS emp 
ON 
    cus.SupportRepId=emp.EmployeeId
GROUP BY
    EmployeeId;

 * sqlite:///chinook.db
Done.

[]

In [38]:
%%sql
SELECT 
    COUNT(c.SupportRepId) Count_of_Customers_Serviced ,
    e.EmployeeId, 
    e.LastName
FROM 
    customers c 
INNER JOIN 
    employees e
ON 
    c.SupportRepId = e.EmployeeId
GROUP BY 
    e.EmployeeId;

 * sqlite:///chinook.db
Done.

[(21, 3, 'Peacock'), (20, 4, 'Park'), (18, 5, 'Johnson')]

## Solutions

### Exercise 1

In [ ]:
%%sql

CREATE VIEW Employee_View AS 
SELECT LastName, FirstName, Title, Country
FROM Employees;

### Exercise 2

In [ ]:
%%sql

SELECT * FROM Employee_View
WHERE Title LIKE '%Sales%'

### Exercise 3

In [ ]:
%%sql

CREATE VIEW Customer_Support_View AS
SELECT c.FirstName Customer_Name, c.LastName Customer_Surname, c.Country Customer_Country, c.SupportRepId, e.EmployeeId, e.LastName Employee_surname, e.FirstName Employee_first_name, e.Title Employee_job_title, e.Country Employee_Country
FROM customers c 
INNER JOIN employees e
ON c.SupportRepId = e.EmployeeId

### Exercise 4

In [21]:
%%sql

SELECT
    *
FROM Customer_Support_View
WHERE Employeeid = 3;

 * sqlite:///chinook.db
Done.

[('Gonçalves', 'Luís', 'Brazil', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Tremblay', 'François', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Almeida', 'Roberto', 'Brazil', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Peterson', 'Jennifer', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Brooks', 'Michelle', 'USA', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Goyer', 'Tim', 'USA', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Ralston', 'Frank', 'USA', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Brown', 'Robert', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Francis', 'Edward', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Sullivan', 'Ellie', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Zimmermann', 'Fynn', 'Germany', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Schröder', 'Niklas', 'Germany', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Girard', 'Wyatt', 'France', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Mercier', 'Isabelle', 'France', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Hämäläinen', 'Terhi', 'Finland', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Kovács', 'Ladislav', 'Hungary', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ("O'Reilly", 'Hugh', 'Ireland', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Jones', 'Emma', 'United Kingdom', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Hughes', 'Phil', 'United Kingdom', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Pareek', 'Manoj', 'India', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Srivastava', 'Puja', 'India', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada')]

### Exercise 5

In [ ]:
%%sql

CREATE VIEW Customer_per_Country_View AS 
SELECT COUNT (CustomerId) AS Num_customers, Country
FROM customers
GROUP BY Country;

### Exercise 6

In [26]:
%%sql

SELECT Country, MAX(no_of_customers) 
FROM Customer_per_Country_View;

 * sqlite:///chinook.db
Done.

[('USA', 13)]

### Exercise 7

In [ ]:
%%sql

DROP VIEW Employee_View

### Challenge question

In [ ]:
%%sql

CREATE VIEW Support_Person_Stats AS
SELECT COUNT(c.SupportRepId) Count_of_Customers_Serviced , e.EmployeeId, e.LastName
FROM customers c 
INNER JOIN employees e
ON c.SupportRepId = e.EmployeeId
GROUP BY e.EmployeeId;

* Note: Because views are added to the main database after they are created, if we want to perform the `CREATE VIEW` commands again, we must first drop the prior view to prevent receiving a 'VIEW already exists' error.

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>